#### Importing libraries

In [1]:
import pandas as pd
from imdb import IMDb

#### Reading in files

In [2]:
df_ratings= pd.read_csv('ratings.csv')
df_movies= pd.read_csv('movies.csv')
df_links= pd.read_csv('links.csv')
df_tags= pd.read_csv('tags.csv')

#### Having a look at the data and its contents

In [3]:
df_ratings.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [4]:
df_ratings= df_ratings.drop(columns= ['userId', 'timestamp'])
df_ratings= df_ratings.groupby(['movieId']).mean()
df_ratings.head()

           rating
movieId
1        3.920930
2        3.431818
3        3.259615
4        2.357143
5        3.071429

In [5]:
df_movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [6]:
df_movies= df_movies.drop(columns= ['title'])

In [7]:
df_links.head()

   movieId  imdbId   tmdbId
0        1  114709    862.0
1        2  113497   8844.0
2        3  113228  15602.0
3        4  114885  31357.0
4        5  113041  11862.0

In [8]:
df_tags.head()

   userId  movieId              tag   timestamp
0       2    60756            funny  1445714994
1       2    60756  Highly quotable  1445714996
2       2    60756     will ferrell  1445714992
3       2    89774     Boxing story  1445715207
4       2    89774              MMA  1445715200

#### Checking null value constraints for data cleaning

In [9]:
print("df_ratings: ", df_ratings.isnull().values.any())
print("df_movies ", df_movies.isnull().values.any())
print("df_links: ", df_links.isnull().values.any())
print("df_tags: ", df_tags.isnull().values.any())

df_ratings:  False
df_movies  False
df_links:  True
df_tags:  False

#### Eliminating null data

In [10]:
df_links.isnull().sum()

movieId    0
imdbId     0
tmdbId     8
dtype: int64

In [11]:
df_links= df_links.drop(columns= ['tmdbId'])

#### Data is now clean

In [12]:
print("df_links: ", df_links.isnull().values.any())

df_links:  False

#### Data Merge

In [13]:
df = pd.merge(df_ratings, df_movies, on='movieId', how='inner')

In [14]:
df= pd.merge(df, df_links, on='movieId', how='inner')

In [15]:
df.head()

   movieId    rating                                       genres  imdbId
0        1  3.920930  Adventure|Animation|Children|Comedy|Fantasy  114709
1        2  3.431818                   Adventure|Children|Fantasy  113497
2        3  3.259615                               Comedy|Romance  113228
3        4  2.357143                         Comedy|Drama|Romance  114885
4        5  3.071429                                       Comedy  113041

In [16]:
df.to_csv("clean_data.csv", index=False)